module {
  func.func @main() {
    %true = arith.constant true
    %c941507673_i32 = arith.constant 941507673 : i32
    %false = arith.constant false
    %c1683202192_i32 = arith.constant 1683202192 : i32
    %c1126504254_i32 = arith.constant 1126504254 : i32
    %c1523482504_i32 = arith.constant 1523482504 : i32
    %cst = arith.constant 1.57152333E+9 : f32
    %cst_0 = arith.constant 0x4D8BF6A6 : f32
    %cst_1 = arith.constant 1.95751206E+9 : f32
    %cst_2 = arith.constant 1.71997427E+9 : f32
    %0 = tensor.empty() : tensor<4xf32>
    %1 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%0 : tensor<4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4xf32>
    %2 = tensor.empty() : tensor<4xi1>
    %3 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%2 : tensor<4xi1>) {
    ^bb0(%out: i1):
      linalg.yield %true : i1
    } -> tensor<4xi1>
    %4 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%2 : tensor<4xi1>) {
    ^bb0(%out: i1):
      linalg.yield %true : i1
    } -> tensor<4xi1>
    %5 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%0 : tensor<4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4xf32>
    %6 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%0 : tensor<4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4xf32>
    %7 = tensor.empty() : tensor<4x4xi32>
    %8 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%7 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %c1_i32_24 = arith.constant 1 : i32
      linalg.yield %c1_i32_24 : i32
    } -> tensor<4x4xi32>
    %9 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%0 : tensor<4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4xf32>
    %10 = tensor.empty() : tensor<4x4xf32>
    %11 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%10 : tensor<4x4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4x4xf32>
    %12 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%7 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %c1_i32_24 = arith.constant 1 : i32
      linalg.yield %c1_i32_24 : i32
    } -> tensor<4x4xi32>
    %13 = tensor.empty() : tensor<4x4xi1>
    %14 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%13 : tensor<4x4xi1>) {
    ^bb0(%out: i1):
      linalg.yield %true : i1
    } -> tensor<4x4xi1>
    %15 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%0 : tensor<4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4xf32>
    %16 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%0 : tensor<4xf32>) {
    ^bb0(%out: f32):
      %cst_24 = arith.constant 1.000000e+00 : f32
      linalg.yield %cst_24 : f32
    } -> tensor<4xf32>
    %17 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%2 : tensor<4xi1>) {
    ^bb0(%out: i1):
      linalg.yield %true : i1
    } -> tensor<4xi1>
    %18 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%7 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %c1_i32_24 = arith.constant 1 : i32
      linalg.yield %c1_i32_24 : i32
    } -> tensor<4x4xi32>
    %19 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%7 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %c1_i32_24 = arith.constant 1 : i32
      linalg.yield %c1_i32_24 : i32
    } -> tensor<4x4xi32>
    %20 = tensor.empty() : tensor<4xi32>
    %21 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} outs(%20 : tensor<4xi32>) {
    ^bb0(%out: i32):
      %c1_i32_24 = arith.constant 1 : i32
      linalg.yield %c1_i32_24 : i32
    } -> tensor<4xi32>
    %c0 = arith.constant 0 : index
    %c1 = arith.constant 1 : index
    %c2 = arith.constant 2 : index
    %c3 = arith.constant 3 : index
    %alloc = memref.alloc() : memref<4xi32>
    %c1_i32 = arith.constant 1 : i32
    affine.store %c1_i32, %alloc[%c0] : memref<4xi32>
    affine.store %c1_i32, %alloc[%c1] : memref<4xi32>
    affine.store %c1_i32, %alloc[%c2] : memref<4xi32>
    affine.store %c1_i32, %alloc[%c3] : memref<4xi32>
    %alloc_3 = memref.alloc() : memref<4xi1>
    affine.store %true, %alloc_3[%c0] : memref<4xi1>
    affine.store %true, %alloc_3[%c1] : memref<4xi1>
    affine.store %true, %alloc_3[%c2] : memref<4xi1>
    affine.store %true, %alloc_3[%c3] : memref<4xi1>
    %alloc_4 = memref.alloc() : memref<4xi32>
    affine.store %c1_i32, %alloc_4[%c0] : memref<4xi32>
    affine.store %c1_i32, %alloc_4[%c1] : memref<4xi32>
    affine.store %c1_i32, %alloc_4[%c2] : memref<4xi32>
    affine.store %c1_i32, %alloc_4[%c3] : memref<4xi32>
    %alloc_5 = memref.alloc() : memref<4xf32>
    %cst_6 = arith.constant 1.000000e+00 : f32
    affine.store %cst_6, %alloc_5[%c0] : memref<4xf32>
    affine.store %cst_6, %alloc_5[%c1] : memref<4xf32>
    affine.store %cst_6, %alloc_5[%c2] : memref<4xf32>
    affine.store %cst_6, %alloc_5[%c3] : memref<4xf32>
    %alloc_7 = memref.alloc() : memref<4xf32>
    affine.store %cst_6, %alloc_7[%c0] : memref<4xf32>
    affine.store %cst_6, %alloc_7[%c1] : memref<4xf32>
    affine.store %cst_6, %alloc_7[%c2] : memref<4xf32>
    affine.store %cst_6, %alloc_7[%c3] : memref<4xf32>
    %alloc_8 = memref.alloc() : memref<4xf32>
    affine.store %cst_6, %alloc_8[%c0] : memref<4xf32>
    affine.store %cst_6, %alloc_8[%c1] : memref<4xf32>
    affine.store %cst_6, %alloc_8[%c2] : memref<4xf32>
    affine.store %cst_6, %alloc_8[%c3] : memref<4xf32>
    %alloc_9 = memref.alloc() : memref<4xf32>
    affine.store %cst_6, %alloc_9[%c0] : memref<4xf32>
    affine.store %cst_6, %alloc_9[%c1] : memref<4xf32>
    affine.store %cst_6, %alloc_9[%c2] : memref<4xf32>
    affine.store %cst_6, %alloc_9[%c3] : memref<4xf32>
    %alloc_10 = memref.alloc() : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c0, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c0, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c0, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c0, %c3] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c1, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c1, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c1, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c1, %c3] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c2, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c2, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c2, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c2, %c3] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c3, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c3, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c3, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_10[%c3, %c3] : memref<4x4xf32>
    %alloc_11 = memref.alloc() : memref<4x4xi1>
    affine.store %true, %alloc_11[%c0, %c0] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c0, %c1] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c0, %c2] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c0, %c3] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c1, %c0] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c1, %c1] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c1, %c2] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c1, %c3] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c2, %c0] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c2, %c1] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c2, %c2] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c2, %c3] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c3, %c0] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c3, %c1] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c3, %c2] : memref<4x4xi1>
    affine.store %true, %alloc_11[%c3, %c3] : memref<4x4xi1>
    %alloc_12 = memref.alloc() : memref<4xf32>
    affine.store %cst_6, %alloc_12[%c0] : memref<4xf32>
    affine.store %cst_6, %alloc_12[%c1] : memref<4xf32>
    affine.store %cst_6, %alloc_12[%c2] : memref<4xf32>
    affine.store %cst_6, %alloc_12[%c3] : memref<4xf32>
    %alloc_13 = memref.alloc() : memref<4xi1>
    affine.store %true, %alloc_13[%c0] : memref<4xi1>
    affine.store %true, %alloc_13[%c1] : memref<4xi1>
    affine.store %true, %alloc_13[%c2] : memref<4xi1>
    affine.store %true, %alloc_13[%c3] : memref<4xi1>
    %alloc_14 = memref.alloc() : memref<4xi1>
    affine.store %true, %alloc_14[%c0] : memref<4xi1>
    affine.store %true, %alloc_14[%c1] : memref<4xi1>
    affine.store %true, %alloc_14[%c2] : memref<4xi1>
    affine.store %true, %alloc_14[%c3] : memref<4xi1>
    %alloc_15 = memref.alloc() : memref<4xi32>
    affine.store %c1_i32, %alloc_15[%c0] : memref<4xi32>
    affine.store %c1_i32, %alloc_15[%c1] : memref<4xi32>
    affine.store %c1_i32, %alloc_15[%c2] : memref<4xi32>
    affine.store %c1_i32, %alloc_15[%c3] : memref<4xi32>
    %alloc_16 = memref.alloc() : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c0, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c0, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c0, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c0, %c3] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c1, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c1, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c1, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c1, %c3] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c2, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c2, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c2, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c2, %c3] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c3, %c0] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c3, %c1] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c3, %c2] : memref<4x4xf32>
    affine.store %cst_6, %alloc_16[%c3, %c3] : memref<4x4xf32>
    %alloc_17 = memref.alloc() : memref<4xi1>
    affine.store %true, %alloc_17[%c0] : memref<4xi1>
    affine.store %true, %alloc_17[%c1] : memref<4xi1>
    affine.store %true, %alloc_17[%c2] : memref<4xi1>
    affine.store %true, %alloc_17[%c3] : memref<4xi1>
    %alloc_18 = memref.alloc() : memref<4xi32>
    affine.store %c1_i32, %alloc_18[%c0] : memref<4xi32>
    affine.store %c1_i32, %alloc_18[%c1] : memref<4xi32>
    affine.store %c1_i32, %alloc_18[%c2] : memref<4xi32>
    affine.store %c1_i32, %alloc_18[%c3] : memref<4xi32>
    %22 = arith.addi %true, %false : i1
    %23 = arith.mulf %cst_2, %cst_1 : f32
    %24 = arith.divsi %c1126504254_i32, %c1126504254_i32 : i32
    %25 = arith.minimumf %23, %cst_2 : f32
    %26 = arith.cmpf ult, %23, %25 : f32
    %27 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%alloc_4 : memref<4xi32>) outs(%19 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %out: i32):
      %683 = arith.xori %out, %out : i32
      %684 = arith.shrsi %in, %out : i32
      %685 = arith.minsi %684, %out : i32
      %686 = arith.ceildivui %in, %683 : i32
      %687 = arith.muli %686, %685 : i32
      %688 = arith.shli %in, %686 : i32
      %689 = arith.minsi %in, %out : i32
      %690 = arith.shli %687, %687 : i32
      %691 = arith.minui %688, %in : i32
      linalg.yield %691 : i32
    } -> tensor<4x4xi32>
    %28 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%12, %12 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    memref.store %cst_1, %alloc_12[%c1] : memref<4xf32>
    %29 = memref.load %alloc_17[%c2] : memref<4xi1>
    %30 = arith.cmpi ne, %true, %22 : i1
    memref.store %c1683202192_i32, %alloc_18[%c0] : memref<4xi32>
    %31 = arith.remui %29, %false : i1
    memref.store %cst, %alloc_7[%c2] : memref<4xf32>
    %32 = arith.remui %true, %29 : i1
    %33 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%15, %alloc_8 : tensor<4xf32>, memref<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    %34 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%12, %21 : tensor<4x4xi32>, tensor<4xi32>) outs(%8 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.divsi %out, %in : i32
      %c2076951318_i32 = arith.constant 2076951318 : i32
      %684 = arith.divui %in, %in_24 : i32
      %685 = arith.ceildivsi %out, %c2076951318_i32 : i32
      %686 = arith.shli %in_24, %685 : i32
      %687 = arith.remui %in, %685 : i32
      %688 = arith.divsi %684, %in_24 : i32
      %689 = arith.cmpi sge, %out, %687 : i32
      %690 = arith.remui %in, %c2076951318_i32 : i32
      %691 = arith.cmpi ule, %out, %686 : i32
      linalg.yield %in_24 : i32
    } -> tensor<4x4xi32>
    memref.store %true, %alloc_11[%c2, %c1] : memref<4x4xi1>
    %35 = memref.load %alloc_18[%c0] : memref<4xi32>
    %36 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_7, %alloc_7 : memref<4xf32>, memref<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    %37 = memref.load %alloc_12[%c3] : memref<4xf32>
    %38 = arith.maxui %29, %32 : i1
    %39 = linalg.matmul ins(%11, %11 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%10 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %40 = arith.remf %cst, %cst_0 : f32
    %41 = memref.load %alloc_4[%c2] : memref<4xi32>
    %42 = arith.remf %cst_0, %23 : f32
    memref.store %cst, %alloc_10[%c2, %c3] : memref<4x4xf32>
    %43 = linalg.matmul ins(%27, %12 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %44 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%8, %28 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %45 = linalg.matmul ins(%14, %14 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) -> tensor<4x4xi1>
    %46 = arith.minui %c1523482504_i32, %c1126504254_i32 : i32
    %47 = arith.remf %cst, %23 : f32
    memref.copy %alloc_9, %alloc_8 : memref<4xf32> to memref<4xf32>
    %48 = memref.load %alloc_12[%c3] : memref<4xf32>
    %49 = arith.maxsi %true, %true : i1
    %50 = linalg.matmul ins(%19, %8 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    memref.copy %alloc_12, %alloc_8 : memref<4xf32> to memref<4xf32>
    %51 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%11, %39 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%10 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4x4xf32>
    %52 = arith.minsi %c1523482504_i32, %c1126504254_i32 : i32
    %53 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%36 : tensor<4xf32>) outs(%39 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %out: f32):
      %683 = arith.minimumf %in, %in : f32
      %684 = arith.mulf %out, %out : f32
      %685 = arith.mulf %683, %in : f32
      %686 = arith.negf %in : f32
      %687 = arith.minimumf %out, %in : f32
      %688 = arith.remf %686, %686 : f32
      %689 = arith.divf %688, %688 : f32
      %690 = arith.remf %687, %688 : f32
      %691 = arith.remf %685, %683 : f32
      %692 = arith.minimumf %690, %689 : f32
      %693 = arith.remf %in, %684 : f32
      linalg.yield %693 : f32
    } -> tensor<4x4xf32>
    %54 = arith.minimumf %47, %23 : f32
    %55 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%44, %18 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %56 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_5, %alloc_7 : memref<4xf32>, memref<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    %57 = arith.muli %38, %32 : i1
    memref.store %cst, %alloc_9[%c2] : memref<4xf32>
    memref.store %true, %alloc_14[%c3] : memref<4xi1>
    %58 = memref.load %alloc_12[%c1] : memref<4xf32>
    %59 = arith.mulf %54, %42 : f32
    memref.copy %alloc_12, %alloc_9 : memref<4xf32> to memref<4xf32>
    %60 = arith.maximumf %cst, %25 : f32
    %61 = linalg.matmul ins(%27, %8 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %alloc_19 = memref.alloc() : memref<4x4xi1>
    memref.copy %alloc_11, %alloc_19 : memref<4x4xi1> to memref<4x4xi1>
    %62 = linalg.matmul ins(%14, %14 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) -> tensor<4x4xi1>
    %63 = linalg.matmul ins(%14, %62 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) -> tensor<4x4xi1>
    memref.store %true, %alloc_13[%c3] : memref<4xi1>
    %64 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%alloc_10, %alloc_10 : memref<4x4xf32>, memref<4x4xf32>) outs(%10 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4x4xf32>
    %65 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%6, %56 : tensor<4xf32>, tensor<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    %66 = linalg.matmul ins(%50, %43 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %67 = arith.shrui %46, %c1683202192_i32 : i32
    %68 = memref.load %alloc_14[%c1] : memref<4xi1>
    %69 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%61 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %683 = arith.ceildivui %out, %out : i32
      %684 = arith.andi %683, %683 : i32
      %685 = arith.xori %683, %684 : i32
      %686 = arith.minui %out, %685 : i32
      %687 = arith.minsi %683, %685 : i32
      %688 = arith.maxsi %686, %685 : i32
      %689 = arith.maxsi %687, %686 : i32
      %690 = arith.minsi %out, %686 : i32
      %691 = arith.shrui %687, %685 : i32
      %692 = arith.xori %685, %684 : i32
      %693 = arith.remsi %688, %686 : i32
      linalg.yield %693 : i32
    } -> tensor<4x4xi32>
    %70 = arith.maximumf %54, %58 : f32
    %71 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%12 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %683 = arith.shrui %out, %out : i32
      %684 = arith.shli %683, %out : i32
      %685 = arith.maxui %out, %out : i32
      %686 = arith.maxui %685, %684 : i32
      %687 = arith.xori %685, %684 : i32
      %688 = arith.ceildivsi %687, %683 : i32
      %689 = arith.divui %686, %686 : i32
      %690 = arith.subi %685, %686 : i32
      linalg.yield %686 : i32
    } -> tensor<4x4xi32>
    %72 = arith.ori %24, %c1523482504_i32 : i32
    %73 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%44 : tensor<4x4xi32>) outs(%43 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %out: i32):
      %683 = arith.divui %out, %in : i32
      %684 = arith.maxsi %out, %in : i32
      %685 = arith.andi %684, %683 : i32
      %686 = arith.divsi %out, %out : i32
      %687 = arith.cmpi ugt, %685, %684 : i32
      %688 = arith.shrui %686, %683 : i32
      %689 = arith.ceildivsi %688, %688 : i32
      %690 = arith.floordivsi %in, %685 : i32
      %691 = arith.shrui %690, %in : i32
      %692 = arith.addi %in, %689 : i32
      linalg.yield %692 : i32
    } -> tensor<4x4xi32>
    %74 = arith.minsi %c1523482504_i32, %c941507673_i32 : i32
    %75 = linalg.matmul ins(%43, %27 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    memref.copy %alloc_14, %alloc_3 : memref<4xi1> to memref<4xi1>
    %76 = arith.mulf %25, %cst_1 : f32
    %77 = arith.divsi %c1126504254_i32, %74 : i32
    %78 = arith.cmpi eq, %30, %true : i1
    %79 = arith.shrui %true, %true : i1
    %80 = arith.floordivsi %29, %79 : i1
    memref.store %46, %alloc[%c1] : memref<4xi32>
    memref.store %37, %alloc_10[%c1, %c2] : memref<4x4xf32>
    %81 = arith.divui %22, %true : i1
    %82 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%44, %12 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %83 = memref.load %alloc[%c1] : memref<4xi32>
    %84 = arith.mulf %70, %37 : f32
    %85 = linalg.matmul ins(%69, %44 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %86 = arith.minsi %c941507673_i32, %72 : i32
    %87 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc, %alloc_18 : memref<4xi32>, memref<4xi32>) outs(%20 : tensor<4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4xi32>
    %88 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%19 : tensor<4x4xi32>) outs(%69 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %out: i32):
      %683 = arith.divui %in, %in : i32
      %684 = arith.andi %683, %out : i32
      %685 = arith.divui %false, %false : i1
      %686 = arith.remsi %false, %685 : i1
      %687 = arith.addi %out, %out : i32
      %688 = arith.divsi %684, %684 : i32
      %689 = arith.minui %false, %false : i1
      linalg.yield %687 : i32
    } -> tensor<4x4xi32>
    %89 = linalg.matmul ins(%45, %14 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) -> tensor<4x4xi1>
    %90 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%61 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %683 = arith.cmpi sge, %out, %out : i32
      %684 = arith.maxsi %683, %683 : i1
      %c1795266629_i32 = arith.constant 1795266629 : i32
      %685 = arith.andi %684, %683 : i1
      %686 = arith.remsi %685, %683 : i1
      %687 = arith.cmpi ugt, %686, %684 : i1
      %688 = arith.shrsi %c1795266629_i32, %out : i32
      %689 = arith.minsi %683, %683 : i1
      %c846388670_i32 = arith.constant 846388670 : i32
      linalg.yield %c846388670_i32 : i32
    } -> tensor<4x4xi32>
    memref.copy %alloc_7, %alloc_5 : memref<4xf32> to memref<4xf32>
    %91 = linalg.matmul ins(%82, %75 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %92 = linalg.matmul ins(%8, %12 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    memref.store %true, %alloc_19[%c3, %c1] : memref<4x4xi1>
    %93 = arith.shli %57, %31 : i1
    %94 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%15, %6, %alloc_10 : tensor<4xf32>, tensor<4xf32>, memref<4x4xf32>) outs(%64 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %in_25: f32, %out: f32):
      %683 = arith.divf %out, %out : f32
      %684 = arith.mulf %in, %in_24 : f32
      %685 = arith.remf %in_24, %in_25 : f32
      %686 = arith.remf %in, %in : f32
      %687 = arith.mulf %in_25, %out : f32
      %688 = arith.addf %in_24, %in : f32
      %689 = arith.negf %684 : f32
      %690 = arith.maximumf %685, %685 : f32
      %691 = arith.mulf %685, %683 : f32
      linalg.yield %691 : f32
    } -> tensor<4x4xf32>
    %95 = memref.load %alloc_14[%c0] : memref<4xi1>
    memref.copy %alloc_18, %alloc : memref<4xi32> to memref<4xi32>
    %96 = arith.divf %48, %cst_1 : f32
    %97 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_3, %alloc_17 : memref<4xi1>, memref<4xi1>) outs(%2 : tensor<4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4xi1>
    %98 = linalg.matmul ins(%92, %8 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %99 = memref.load %alloc_5[%c3] : memref<4xf32>
    memref.store %60, %alloc_9[%c1] : memref<4xf32>
    memref.copy %alloc_8, %alloc_5 : memref<4xf32> to memref<4xf32>
    %100 = arith.divui %31, %78 : i1
    memref.copy %alloc_14, %alloc_3 : memref<4xi1> to memref<4xi1>
    %c92588919_i32 = arith.constant 92588919 : i32
    memref.copy %alloc_19, %alloc_11 : memref<4x4xi1> to memref<4x4xi1>
    %101 = linalg.matmul ins(%55, %8 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %102 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%alloc_10, %alloc_8, %11 : memref<4x4xf32>, memref<4xf32>, tensor<4x4xf32>) outs(%11 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %in_25: f32, %out: f32):
      %683 = arith.remf %out, %in : f32
      %684 = arith.negf %683 : f32
      %685 = arith.maximumf %in_25, %684 : f32
      %686 = arith.minimumf %in_25, %in : f32
      %687 = arith.mulf %686, %684 : f32
      %688 = arith.divf %685, %in_24 : f32
      %689 = arith.addf %685, %685 : f32
      %690 = arith.maximumf %686, %684 : f32
      %691 = arith.mulf %690, %685 : f32
      %692 = arith.remf %687, %686 : f32
      linalg.yield %688 : f32
    } -> tensor<4x4xf32>
    %103 = arith.minimumf %96, %25 : f32
    %104 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%82 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %683 = arith.shrsi %out, %out : i32
      %684 = arith.remui %683, %683 : i32
      %685 = arith.muli %684, %683 : i32
      %686 = arith.minui %out, %684 : i32
      %687 = arith.ceildivsi %686, %683 : i32
      %688 = arith.minsi %685, %out : i32
      %689 = arith.shrui %683, %683 : i32
      %690 = arith.maxsi %684, %685 : i32
      %691 = arith.minsi %687, %686 : i32
      %692 = arith.minui %684, %689 : i32
      %693 = arith.remui %689, %out : i32
      %694 = arith.addi %692, %693 : i32
      linalg.yield %688 : i32
    } -> tensor<4x4xi32>
    %105 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%alloc_18, %alloc_18, %87 : memref<4xi32>, memref<4xi32>, tensor<4xi32>) outs(%104 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %in_25: i32, %out: i32):
      %683 = arith.ceildivui %in_24, %in : i32
      %684 = arith.remui %in, %in_24 : i32
      %685 = arith.maxsi %out, %683 : i32
      %686 = arith.divui %684, %in : i32
      %687 = arith.shrui %686, %683 : i32
      %688 = arith.floordivsi %in_24, %in : i32
      %689 = arith.ceildivsi %688, %683 : i32
      %690 = arith.subi %out, %in_24 : i32
      linalg.yield %685 : i32
    } -> tensor<4x4xi32>
    %106 = arith.divui %c941507673_i32, %c1126504254_i32 : i32
    memref.store %c1683202192_i32, %alloc_4[%c1] : memref<4xi32>
    %107 = arith.xori %29, %true : i1
    %108 = arith.remui %41, %52 : i32
    %109 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%4, %97 : tensor<4xi1>, tensor<4xi1>) outs(%2 : tensor<4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4xi1>
    %110 = arith.andi %80, %true : i1
    %111 = memref.load %alloc_7[%c0] : memref<4xf32>
    %112 = arith.maximumf %42, %48 : f32
    %113 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_14, %alloc_14 : memref<4xi1>, memref<4xi1>) outs(%2 : tensor<4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4xi1>
    %114 = arith.muli %46, %83 : i32
    %115 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%45, %45 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4x4xi1>
    %116 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%104, %73 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %117 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%71, %18 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    memref.store %23, %alloc_16[%c0, %c2] : memref<4x4xf32>
    %118 = memref.load %alloc_13[%c1] : memref<4xi1>
    %119 = linalg.matmul ins(%75, %19 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %120 = arith.shli %107, %32 : i1
    memref.copy %alloc_19, %alloc_11 : memref<4x4xi1> to memref<4x4xi1>
    %121 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%19, %44 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %122 = memref.load %alloc_18[%c3] : memref<4xi32>
    %123 = memref.load %alloc_7[%c1] : memref<4xf32>
    %124 = linalg.matmul ins(%18, %75 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %125 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_12, %16 : memref<4xf32>, tensor<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    memref.copy %alloc_17, %alloc_13 : memref<4xi1> to memref<4xi1>
    %126 = linalg.matmul ins(%101, %61 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %127 = arith.ori %120, %107 : i1
    %128 = arith.divui %false, %true : i1
    %129 = memref.load %alloc_7[%c3] : memref<4xf32>
    %130 = arith.minimumf %59, %60 : f32
    %131 = linalg.matmul ins(%105, %124 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %132 = linalg.matmul ins(%18, %85 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    memref.copy %alloc_11, %alloc_19 : memref<4x4xi1> to memref<4x4xi1>
    %133 = linalg.matmul ins(%105, %19 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %134 = arith.addf %123, %48 : f32
    memref.store %129, %alloc_7[%c1] : memref<4xf32>
    %135 = arith.addi %83, %35 : i32
    %136 = arith.floordivsi %46, %86 : i32
    %137 = arith.addi %72, %74 : i32
    %138 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d1, d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%alloc_3, %alloc_3, %alloc_11 : memref<4xi1>, memref<4xi1>, memref<4x4xi1>) outs(%62 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %in_25: i1, %out: i1):
      %683 = arith.floordivsi %out, %in_25 : i1
      %684 = arith.subi %683, %in_25 : i1
      %685 = arith.divui %684, %in_25 : i1
      %686 = arith.minsi %out, %684 : i1
      %687 = arith.maxsi %in, %in_25 : i1
      %688 = arith.minui %out, %out : i1
      %689 = arith.maxui %683, %688 : i1
      %690 = arith.minui %683, %689 : i1
      %691 = arith.divsi %684, %687 : i1
      %692 = arith.floordivsi %689, %685 : i1
      linalg.yield %686 : i1
    } -> tensor<4x4xi1>
    %139 = arith.andi %true, %49 : i1
    %140 = memref.load %alloc[%c0] : memref<4xi32>
    %141 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%63, %138 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4x4xi1>
    %142 = memref.load %alloc_10[%c1, %c3] : memref<4x4xf32>
    %143 = arith.muli %81, %120 : i1
    %144 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%116, %131 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %145 = memref.load %alloc_15[%c2] : memref<4xi32>
    %146 = linalg.matmul ins(%124, %91 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %147 = memref.load %alloc_14[%c3] : memref<4xi1>
    %148 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%126, %34 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %149 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%5, %33 : tensor<4xf32>, tensor<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    %150 = arith.xori %true, %127 : i1
    %151 = arith.muli %128, %93 : i1
    %152 = arith.maxsi %118, %29 : i1
    %153 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%87, %alloc_15, %69 : tensor<4xi32>, memref<4xi32>, tensor<4x4xi32>) outs(%144 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %in_25: i32, %out: i32):
      %683 = arith.addi %in, %out : i32
      %684 = arith.remui %683, %out : i32
      %685 = arith.shli %in_25, %684 : i32
      %686 = arith.divsi %out, %684 : i32
      %687 = arith.andi %683, %in : i32
      %688 = arith.shrsi %686, %685 : i32
      %689 = arith.ceildivui %684, %in : i32
      %690 = arith.shrui %in_25, %in : i32
      linalg.yield %685 : i32
    } -> tensor<4x4xi32>
    %154 = arith.minimumf %cst_0, %103 : f32
    memref.store %cst_2, %alloc_10[%c1, %c1] : memref<4x4xf32>
    %155 = arith.addi %true, %49 : i1
    %156 = linalg.matmul ins(%89, %14 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) -> tensor<4x4xi1>
    %157 = arith.mulf %48, %76 : f32
    %158 = arith.divsi %30, %139 : i1
    %159 = arith.maxui %80, %true : i1
    %160 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_7, %149 : memref<4xf32>, tensor<4xf32>) outs(%0 : tensor<4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.mulf %in, %in_24 : f32
      linalg.yield %683 : f32
    } -> tensor<4xf32>
    memref.store %154, %alloc_10[%c1, %c0] : memref<4x4xf32>
    memref.store %60, %alloc_5[%c1] : memref<4xf32>
    %161 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%109 : tensor<4xi1>) outs(%138 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %out: i1):
      %683 = arith.xori %out, %out : i1
      %684 = arith.ceildivui %683, %in : i1
      %685 = arith.cmpi ugt, %683, %684 : i1
      %686 = arith.maxsi %685, %in : i1
      %687 = arith.shrsi %out, %685 : i1
      %688 = arith.shrui %683, %true : i1
      %689 = arith.ceildivsi %true, %687 : i1
      %690 = arith.addi %684, %in : i1
      %691 = arith.addi %688, %687 : i1
      linalg.yield %688 : i1
    } -> tensor<4x4xi1>
    %162 = arith.remf %59, %37 : f32
    memref.copy %alloc_8, %alloc_9 : memref<4xf32> to memref<4xf32>
    %163 = linalg.matmul ins(%51, %39 : tensor<4x4xf32>, tensor<4x4xf32>) outs(%10 : tensor<4x4xf32>) -> tensor<4x4xf32>
    %164 = memref.load %alloc_8[%c0] : memref<4xf32>
    %cst_20 = arith.constant 1.7573719E+9 : f32
    %165 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%69 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %683 = arith.maxui %out, %out : i32
      %684 = arith.maxsi %683, %out : i32
      %685 = arith.minsi %684, %684 : i32
      %686 = arith.floordivsi %684, %out : i32
      %687 = arith.shrsi %out, %686 : i32
      %688 = arith.remsi %687, %685 : i32
      %689 = arith.floordivsi %683, %687 : i32
      %690 = arith.andi %683, %687 : i32
      %691 = arith.maxui %687, %687 : i32
      %692 = arith.maxsi %688, %689 : i32
      %693 = arith.andi %690, %687 : i32
      linalg.yield %692 : i32
    } -> tensor<4x4xi32>
    memref.store %123, %alloc_12[%c3] : memref<4xf32>
    %166 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%73, %82 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %167 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_15, %alloc_4 : memref<4xi32>, memref<4xi32>) outs(%20 : tensor<4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4xi32>
    memref.store %129, %alloc_12[%c3] : memref<4xf32>
    %168 = arith.shli %143, %127 : i1
    memref.store %c1126504254_i32, %alloc_15[%c1] : memref<4xi32>
    %169 = memref.load %alloc_10[%c2, %c2] : memref<4x4xf32>
    %170 = arith.muli %30, %false : i1
    %171 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%16, %1 : tensor<4xf32>, tensor<4xf32>) outs(%94 : tensor<4x4xf32>) {
    ^bb0(%in: f32, %in_24: f32, %out: f32):
      %683 = arith.maximumf %out, %in : f32
      %684 = arith.mulf %out, %in : f32
      %685 = arith.maximumf %in_24, %in_24 : f32
      %686 = arith.divf %685, %685 : f32
      %687 = arith.addf %out, %683 : f32
      %cst_25 = arith.constant 1.05646566E+9 : f32
      linalg.yield %685 : f32
    } -> tensor<4x4xf32>
    %172 = linalg.matmul ins(%14, %89 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) -> tensor<4x4xi1>
    %173 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%3, %3, %97 : tensor<4xi1>, tensor<4xi1>, tensor<4xi1>) outs(%141 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %in_25: i1, %out: i1):
      %683 = arith.shrui %in_24, %in_25 : i1
      %684 = arith.divui %in, %in_25 : i1
      %685 = arith.ceildivsi %683, %in_24 : i1
      %686 = arith.minui %in_24, %in_25 : i1
      %687 = arith.shli %685, %in_25 : i1
      %688 = arith.remsi %in_24, %686 : i1
      %689 = arith.maxui %in, %688 : i1
      %690 = arith.maxsi %687, %out : i1
      %691 = arith.remui %in_24, %683 : i1
      %692 = arith.muli %690, %688 : i1
      %693 = arith.divui %683, %in : i1
      linalg.yield %693 : i1
    } -> tensor<4x4xi1>
    %174 = memref.load %alloc_11[%c1, %c3] : memref<4x4xi1>
    %175 = arith.remsi %108, %41 : i32
    memref.store %25, %alloc_10[%c1, %c0] : memref<4x4xf32>
    memref.store %151, %alloc_3[%c0] : memref<4xi1>
    %176 = arith.divui %false, %78 : i1
    %177 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%19, %28 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    memref.store %84, %alloc_9[%c3] : memref<4xf32>
    %178 = memref.load %alloc_13[%c0] : memref<4xi1>
    memref.copy %alloc_8, %alloc_5 : memref<4xf32> to memref<4xf32>
    %179 = arith.minsi %81, %false : i1
    %180 = arith.subi %170, %110 : i1
    memref.store %129, %alloc_9[%c2] : memref<4xf32>
    %181 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%63, %89 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4x4xi1>
    %182 = linalg.matmul ins(%43, %88 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %183 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%69, %177 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %184 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_15, %21 : memref<4xi32>, tensor<4xi32>) outs(%20 : tensor<4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4xi32>
    %185 = memref.load %alloc_8[%c0] : memref<4xf32>
    %186 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%alloc_4 : memref<4xi32>) outs(%146 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %out: i32):
      %683 = arith.shrsi %out, %in : i32
      %684 = arith.maxui %683, %in : i32
      %685 = arith.ceildivui %out, %out : i32
      %686 = arith.minsi %out, %in : i32
      %687 = arith.muli %684, %686 : i32
      %688 = arith.cmpi eq, %687, %685 : i32
      %689 = arith.xori %688, %688 : i1
      %690 = arith.muli %false, %688 : i1
      %691 = arith.maxsi %false, %689 : i1
      linalg.yield %686 : i32
    } -> tensor<4x4xi32>
    memref.copy %alloc_16, %alloc_10 : memref<4x4xf32> to memref<4x4xf32>
    %187 = linalg.matmul ins(%61, %165 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) -> tensor<4x4xi32>
    %188 = memref.load %alloc_10[%c0, %c0] : memref<4x4xf32>
    %189 = arith.remf %123, %42 : f32
    memref.copy %alloc_17, %alloc_3 : memref<4xi1> to memref<4xi1>
    %190 = memref.load %alloc_12[%c2] : memref<4xf32>
    %191 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%161, %156 : tensor<4x4xi1>, tensor<4x4xi1>) outs(%13 : tensor<4x4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4x4xi1>
    %192 = linalg.generic {indexing_maps = [affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>, affine_map<(d0) -> (d0)>], iterator_types = ["parallel"]} ins(%alloc_13, %4 : memref<4xi1>, tensor<4xi1>) outs(%2 : tensor<4xi1>) {
    ^bb0(%in: i1, %in_24: i1, %out: i1):
      %683 = arith.muli %in, %in_24 : i1
      linalg.yield %683 : i1
    } -> tensor<4xi1>
    memref.store %54, %alloc_9[%c1] : memref<4xf32>
    %193 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>, affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} ins(%12, %19 : tensor<4x4xi32>, tensor<4x4xi32>) outs(%7 : tensor<4x4xi32>) {
    ^bb0(%in: i32, %in_24: i32, %out: i32):
      %683 = arith.muli %in, %in_24 : i32
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    memref.copy %alloc_9, %alloc_5 : memref<4xf32> to memref<4xf32>
    %194 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%171 : tensor<4x4xf32>) {
    ^bb0(%out: f32):
      %683 = arith.divf %out, %out : f32
      %684 = arith.addf %683, %out : f32
      %685 = arith.mulf %683, %out : f32
      %686 = arith.remf %684, %685 : f32
      %687 = arith.maximumf %out, %685 : f32
      %688 = arith.divf %683, %686 : f32
      %689 = arith.minimumf %687, %684 : f32
      %690 = arith.addf %686, %684 : f32
      %691 = arith.negf %685 : f32
      linalg.yield %691 : f32
    } -> tensor<4x4xf32>
    memref.store %49, %alloc_14[%c1] : memref<4xi1>
    %195 = arith.remf %99, %cst_1 : f32
    %196 = memref.load %alloc_17[%c2] : memref<4xi1>
    %197 = linalg.generic {indexing_maps = [affine_map<(d0, d1) -> (d0, d1)>], iterator_types = ["parallel", "parallel"]} outs(%117 : tensor<4x4xi32>) {
    ^bb0(%out: i32):
      %683 = arith.ceildivui %out, %out : i32
      %684 = arith.cmpi sge, %out, %out : i32
      %685 = arith.remui %684, %684 : i1
      %686 = arith.ceildivsi %685, %685 : i1
      %c1066375642_i32 = arith.constant 1066375642 : i32
      %687 = arith.minsi %685, %684 : i1
      %688 = arith.divsi %684, %685 : i1
      %689 = arith.remui %684, %685 : i1
      %690 = arith.andi %687, %685 : i1
      linalg.yield %683 : i32
    } -> tensor<4x4xi32>
    %198 = arith.minui %122, %35 : i32
    %199 = arith.maximumf %cst_2, %188 : f32
